{
  "project": "Customer Search Application",
  "branchName": "ralph/bulk-random-customer-creation",
  "description": "Bulk Random Customer Creation - Allow users to generate and create 1-1000 random customers at once for testing and demo purposes using a performant bulk API endpoint",
  "userStories": [
    {
      "id": "US-001",
      "title": "Random Customer Data Generator Service",
      "description": "As a developer, I need a service that generates realistic random customer data so that the bulk endpoint can create varied test data.",
      "acceptanceCriteria": [
        "IRandomCustomerGenerator service interface created in Services folder",
        "RandomCustomerGenerator implementation generates realistic random names (first + last name combinations from predefined lists)",
        "Generates valid random email addresses based on generated name with random domain",
        "Generates random phone numbers in valid format (e.g., +1-XXX-XXX-XXXX)",
        "Generates random addresses with street, city, state/region, postal code, and country",
        "GenerateCustomers(int count) method returns list of CreateCustomerDto objects",
        "All generated emails are unique within a batch (append index or random suffix if needed)",
        "Service is registered as scoped service in DI container in Program.cs",
        "Code builds successfully",
        "All tests pass with code coverage greater than 80%"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Bulk Create Customers API Endpoint",
      "description": "As a developer, I need a bulk create endpoint so that the frontend can create many customers in a single API call.",
      "acceptanceCriteria": [
        "POST /api/customers/bulk endpoint added to CustomersController",
        "Endpoint accepts a BulkCreateRequestDto with 'count' property (int)",
        "Endpoint uses IRandomCustomerGenerator to generate customer data",
        "Returns 400 Bad Request if count exceeds 1000 or is less than 1",
        "BulkCreateResponseDto includes: successCount (int), failureCount (int), createdCustomers (array of CustomerResponseDto), errors (array of BulkCreateError with index and message)",
        "Successfully created customers are committed even if some fail validation",
        "Uses Entity Framework AddRange() for batch insert performance",
        "Endpoint documented in Swagger with appropriate attributes",
        "Code builds successfully",
        "All tests pass with code coverage greater than 80%"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "API Client Bulk Create Method",
      "description": "As a frontend developer, I need an API client method to call the bulk create endpoint so that UI components can trigger bulk creation.",
      "acceptanceCriteria": [
        "BulkCreateResponse type defined in lib/api/types.ts with successCount, failureCount, createdCustomers, and errors",
        "BulkCreateError type defined with index (number) and message (string)",
        "customerApi.bulkCreateRandom(count: number) method added to CustomerApiClient",
        "Method calls POST /api/customers/bulk with { count } body",
        "Method has extended timeout (30 seconds) for large batches",
        "Returns typed BulkCreateResponse on success",
        "Handles API errors appropriately with ApiError class",
        "Code builds successfully",
        "All tests pass with code coverage greater than 80%"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Bulk Create Customer UI Dialog",
      "description": "As a user, I want a UI control to specify how many random customers to create so that I can quickly populate the database for testing.",
      "acceptanceCriteria": [
        "GenerateCustomersDialog component created in src/components/GenerateCustomersDialog.tsx",
        "Dialog uses existing shadcn/ui Dialog, Input, Button, and Label components",
        "Dialog contains number input for customer count with min=1 and max=1000",
        "Input validates range and shows error message for invalid values (empty, <1, >1000, non-integer)",
        "Generate button is disabled when input is invalid or while loading",
        "Dialog has Cancel button to close without action",
        "Dialog accepts onSuccess callback prop to notify parent of completion",
        "Code builds successfully",
        "All tests pass with code coverage greater than 80%",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Integrate Bulk Create Dialog into Customer List Page",
      "description": "As a user, I want to access the bulk create feature from the customer list page so that I can quickly generate test data.",
      "acceptanceCriteria": [
        "Generate Random Customers button added to customer list page header/actions area",
        "Button uses outline variant to differentiate from primary actions",
        "Clicking button opens the GenerateCustomersDialog",
        "Loading state shown in dialog while bulk creation is in progress with 'Creating X customers...' message",
        "Success toast shows count of successfully created customers (e.g., 'Successfully created 100 customers')",
        "If partial failure, toast shows both success and failure counts (e.g., 'Created 95 customers. 5 failed.')",
        "Error toast shown if entire operation fails",
        "Customer list refreshes automatically after successful creation",
        "Dialog closes automatically on completion (success or partial success)",
        "Code builds successfully",
        "All tests pass with code coverage greater than 80%",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    }
  ]
}
